OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f4431.h
/*
 * This declarations of the PIC18F4431 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:46 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#ifndef __PIC18F4431_H__
#define __PIC18F4431_H__

//==============================================================================

//==============================================================================
//
//	Register Definitions
//
//==============================================================================


//==============================================================================
//        DFLTCON Bits

extern __at(0x0F60) __sfr DFLTCON;

typedef union
  {
  struct
    {
    unsigned FLTCK0             : 1;
    unsigned FLTCK1             : 1;
    unsigned FLTCK2             : 1;
    unsigned FLT1EN             : 1;
    unsigned FLT2EN             : 1;
    unsigned FLT3EN             : 1;
    unsigned FLT4EN             : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned FLTCK              : 3;
    unsigned                    : 5;
    };
  } __DFLTCONbits_t;

extern __at(0x0F60) volatile __DFLTCONbits_t DFLTCONbits;

#define _FLTCK0                 0x01
#define _FLTCK1                 0x02
#define _FLTCK2                 0x04
#define _FLT1EN                 0x08
#define _FLT2EN                 0x10
#define _FLT3EN                 0x20
#define _FLT4EN                 0x40

//==============================================================================


//==============================================================================
//        CAP3CON Bits

extern __at(0x0F61) __sfr CAP3CON;

typedef union
  {
  struct
    {
    unsigned CAP3M0             : 1;
    unsigned CAP3M1             : 1;
    unsigned CAP3M2             : 1;
    unsigned CAP3M3             : 1;
    unsigned                    : 1;
    unsigned CAP3TMR            : 1;
    unsigned CAP3REN            : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CAP3M              : 4;
    unsigned                    : 4;
    };
  } __CAP3CONbits_t;

extern __at(0x0F61) volatile __CAP3CONbits_t CAP3CONbits;

#define _CAP3M0                 0x01
#define _CAP3M1                 0x02
#define _CAP3M2                 0x04
#define _CAP3M3                 0x08
#define _CAP3TMR                0x20
#define _CAP3REN                0x40

//==============================================================================


//==============================================================================
//        CAP2CON Bits

extern __at(0x0F62) __sfr CAP2CON;

typedef union
  {
  struct
    {
    unsigned CAP2M0             : 1;
    unsigned CAP2M1             : 1;
    unsigned CAP2M2             : 1;
    unsigned CAP2M3             : 1;
    unsigned                    : 1;
    unsigned CAP2TMR            : 1;
    unsigned CAP2REN            : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CAP2M              : 4;
    unsigned                    : 4;
    };
  } __CAP2CONbits_t;

extern __at(0x0F62) volatile __CAP2CONbits_t CAP2CONbits;

#define _CAP2M0                 0x01
#define _CAP2M1                 0x02
#define _CAP2M2                 0x04
#define _CAP2M3                 0x08
#define _CAP2TMR                0x20
#define _CAP2REN                0x40

//==============================================================================


//==============================================================================
//        CAP1CON Bits

extern __at(0x0F63) __sfr CAP1CON;

typedef union
  {
  struct
    {
    unsigned CAP1M0             : 1;
    unsigned CAP1M1             : 1;
    unsigned CAP1M2             : 1;
    unsigned CAP1M3             : 1;
    unsigned                    : 1;
    unsigned CAP1TMR            : 1;
    unsigned CAP1REN            : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CAP1M              : 4;
    unsigned                    : 4;
    };
  } __CAP1CONbits_t;

extern __at(0x0F63) volatile __CAP1CONbits_t CAP1CONbits;

#define _CAP1M0                 0x01
#define _CAP1M1                 0x02
#define _CAP1M2                 0x04
#define _CAP1M3                 0x08
#define _CAP1TMR                0x20
#define _CAP1REN                0x40

//==============================================================================

extern __at(0x0F64) __sfr CAP3BUFL;
extern __at(0x0F64) __sfr MAXCNTL;
extern __at(0x0F65) __sfr CAP3BUFH;
extern __at(0x0F65) __sfr MAXCNTH;
extern __at(0x0F66) __sfr CAP2BUFL;
extern __at(0x0F66) __sfr POSCNTL;
extern __at(0x0F67) __sfr CAP2BUFH;
extern __at(0x0F67) __sfr POSCNTH;
extern __at(0x0F68) __sfr CAP1BUFL;
extern __at(0x0F68) __sfr VELRL;
extern __at(0x0F69) __sfr CAP1BUFH;
extern __at(0x0F69) __sfr VELRH;

//==============================================================================
//        OVDCONS Bits

extern __at(0x0F6A) __sfr OVDCONS;

typedef struct
  {
  unsigned POUT0                : 1;
  unsigned POUT1                : 1;
  unsigned POUT2                : 1;
  unsigned POUT3                : 1;
  unsigned POUT4                : 1;
  unsigned POUT5                : 1;
  unsigned POUT6                : 1;
  unsigned POUT7                : 1;
  } __OVDCONSbits_t;

extern __at(0x0F6A) volatile __OVDCONSbits_t OVDCONSbits;

#define _POUT0                  0x01
#define _POUT1                  0x02
#define _POUT2                  0x04
#define _POUT3                  0x08
#define _POUT4                  0x10
#define _POUT5                  0x20
#define _POUT6                  0x40
#define _POUT7                  0x80

//==============================================================================


//==============================================================================
//        OVDCOND Bits

extern __at(0x0F6B) __sfr OVDCOND;

typedef struct
  {
  unsigned POVD0                : 1;
  unsigned POVD1                : 1;
  unsigned POVD2                : 1;
  unsigned POVD3                : 1;
  unsigned POVD4                : 1;
  unsigned POVD5                : 1;
  unsigned POVD6                : 1;
  unsigned POVD7                : 1;
  } __OVDCONDbits_t;

extern __at(0x0F6B) volatile __OVDCONDbits_t OVDCONDbits;

